{
  "backend/main.mo": "Motoko canister defining user profiles, posts, caves, invites, and authorization with storage and helper modules.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for documentation or build planning.",
  "frontend/index.css": "Global Tailwind-based style sheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML file mounting the React root and loading main.tsx with app metadata and icon.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, authentication gating, theme provider, and profile-setup modal.",
  "frontend/src/components/caves/CaveInvitesPanel.tsx": "UI panel for generating cave invite links, creating tokens, showing results, and copying links to clipboard.",
  "frontend/src/components/caves/CreateCaveDialog.tsx": "Dialog for creating a new cave with name input, validation, and submission via useCreateCave hook.",
  "frontend/src/components/caves/MessageComposer.tsx": "Form for typing and sending cave messages, handling enter-to-submit and disabled state.",
  "frontend/src/components/layout/AppNav.tsx": "Top navigation bar with links, share action, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing global background, nav bar, and main content area.",
  "frontend/src/components/media/MediaPicker.tsx": "File picker for images/videos with validation, preview, and clear support.",
  "frontend/src/components/media/MediaRenderer.tsx": "Renders an image or video blob by inferring media type from its URL.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a single post with author info, content, timestamp, and optional media.",
  "frontend/src/components/posts/PostComposer.tsx": "Form for creating posts with text and optional media upload via ExternalBlob.",
  "frontend/src/components/profile/ProfileEditor.tsx": "Editable form for updating the user's display name and saving profile changes.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Onboarding modal requiring the user to set an initial display name.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar using profile image or derived initials.",
  "frontend/src/components/state/EmptyState.tsx": "Generic empty-state component with icon, message, and optional action button.",
  "frontend/src/components/state/ErrorState.tsx": "Destructive alert displaying a normalized error message.",
  "frontend/src/components/state/LoadingState.tsx": "Skeleton loader rendering post, cave, or message placeholders based on type.",
  "frontend/src/constants/media.ts": "Defines allowed image/video MIME types, max file size limits, and helper functions to validate media files.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for profiles, feed posts, caves, and messaging with mutations and caching.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/CaveChatPage.tsx": "Displays a cave’s messages, members, and message composer with real-time updates and navigation controls.",
  "frontend/src/pages/CavesListPage.tsx": "Shows the list of caves with message/member counts and supports creating and navigating to caves.",
  "frontend/src/pages/ComposePostPage.tsx": "Renders the post composition UI inside a centered layout.",
  "frontend/src/pages/FeedPage.tsx": "Fetches and displays the post feed with loading/error states and navigation to create new posts.",
  "frontend/src/pages/JoinCavePage.tsx": "Handles joining a cave using an invite token and displays loading, success, or error states.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays details for a single post including author info, content, and media, with navigation back to the feed.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the logged-in user's profile, profile editor, and a list of their posts.",
  "frontend/src/pages/SignInPage.tsx": "Provides a styled sign‑in screen that triggers Internet Identity authentication.",
  "frontend/src/utils/appShareLink.ts": "Generates the app's shareable URL and provides a function to copy it to the clipboard.",
  "frontend/src/utils/errors.ts": "Normalizes various error messages into user-friendly strings.",
  "frontend/src/utils/inviteLinks.ts": "Builds invite URLs and includes a clipboard copy helper with fallback support.",
  "frontend/src/utils/time.ts": "Formats timestamps for posts and messages into readable strings.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters across hash and standard routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, plugins, colors, animations, and content paths.",
  "project_state.json": "Project-wide state file describing the app template, its current version, and a list of existing ICP full‑stack features including auth, storage, invites, caves, chat, posts, profiles, navigation, and scaffolding."
}